# Write a Python program using Pandas to count the number of rows and columns of a DataFrame.

```
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

In [2]:
import sqlite3
sqlite3.connect("sqlite.db")

exam_data = """CREATE TABLE exam_data (
        name TEXT NOT NULL,
        score INT NOT NULL,
        attempts INT NOT NULL,
        qualify TEXT NOT NULL,
        labels TEXT NOT NULL
) """

print(exam_data)

CREATE TABLE exam_data (
        name TEXT NOT NULL,
        score INT NOT NULL,
        attempts INT NOT NULL,
        qualify TEXT NOT NULL,
        labels TEXT NOT NULL
)

In [10]:
exam_data = """INSERT INTO exam_data (name, score. attempts. qualify, labels) VALUES (?,?,?,?,?)"""

In [11]:
exam_data('Anatasha', 12.5, 1, 'yes', 'a')
exam_data('Dima', 16.5, 3, 'no', 'b')
exam_data('Katherine', np.nan, 2, 'yes', 'c')
exam_data('James', 9, 2, 'no', 'd')